TurbulanceModels-flat-plate/k-epsilon/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forces;
    libs            ("libforces.so");

    writeControl    timeStep;
    writeInterval   10;
    log             true;

    patches         (wing);
    rho             rhoInf;
    rhoInf          1;
    CofR            (0 0 0);
}

// ************************************************************************* //
