TurbulanceModels-flat-plate/k-epsilon/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|nuTilda|f|v2)"
    {
        solver smoothSolver;
		smoother GaussSeidel;
		tolerance 1e-06;
		relTol 0.1;
    }

	"(U|k|epsilon)Final"
    {
		solver PBiCG;
		preconditioner DILU;
		tolerance 1e-06;
		relTol 0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-5;
        U               1e-6;
        "(k|epsilon|omega|nuTilda|f|v2)" 1e-6;
    }
}

relaxationFactors
{
    equations
    {
        U               0.9; 		// 0.9 is more stable but 0.95 more convergent
        "(U|k|epsilon).*"  0.9;   	// 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
